benchmarks/results/nebulift-uninstrumented-rnd-1_10-c32.txt
Running 10s test @ http://localhost:8000
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.47ms  200.74us   6.07ms   88.73%
    Req/Sec     2.72k   139.04     4.39k    96.89%
  Latency Distribution
     50%    1.43ms
     75%    1.51ms
     90%    1.65ms
     99%    2.25ms
  217863 requests in 10.10s, 71.94MB read
  Non-2xx or 3xx responses: 61518
Requests/sec:  21571.19
Transfer/sec:      7.12MB