benchmarks/results/nebulift-uninstrumented-rnd-1_10-c4.txt
Running 10s test @ http://localhost:8000
  4 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   434.24us   85.00us   3.05ms   75.07%
    Req/Sec     2.27k    56.63     2.41k    67.82%
  Latency Distribution
     50%  416.00us
     75%  482.00us
     90%  541.00us
     99%  691.00us
  91302 requests in 10.10s, 30.13MB read
  Non-2xx or 3xx responses: 25930
Requests/sec:   9040.11
Transfer/sec:      2.98MB