benchmarks/results/nebulift-uninstrumented-rnd-1_2-c1.txt
Running 10s test @ http://localhost:8000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.89ms    0.96ms  10.43ms   73.80%
    Req/Sec   144.67     13.96   181.00     60.00%
  Latency Distribution
     50%    6.97ms
     75%    7.59ms
     90%    7.91ms
     99%    8.69ms
  1443 requests in 10.02s, 558.09KB read
Requests/sec:    144.08
Transfer/sec:     55.72KB