benchmarks/results/nebulift-uninstrumented-rnd-1_5-c4.txt
Running 10s test @ http://localhost:8000
  4 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   424.63us   79.10us   2.45ms   71.47%
    Req/Sec     2.34k    48.70     2.47k    70.30%
  Latency Distribution
     50%  406.00us
     75%  473.00us
     90%  530.00us
     99%  644.00us
  94147 requests in 10.10s, 34.38MB read
  Non-2xx or 3xx responses: 6378
Requests/sec:   9321.19
Transfer/sec:      3.40MB